student_id = ""
f_name = ""
l_name = ""
m_name = ""
hw_list = list()
pa_list = list()
list_visit = list()


# TODO: запрашиваем  id студента 
# TODO: запрашиваем  ФИО студента 
# запрашиваем ФИО студента
# Проверить , чтобы ФИО не содержало цифры и пробелы
# если ФИО не корректно то оповещаем и заново запросить(отдельно для каждой переменной)
# ФИО должно начинаться с большой буквы - title применить 


# TODO: Создать меню - while true 
# TODO: пункты меню 
#  1. Show student data 
#    Student ID: <student_id>
#    Full name: <l_name> <f_name> <m_name>
#    Homeworks: 
#    <position>. <grade_of_minus>
# 
#     Practical tasks:
#    <position>. <grade_of_minus>
#   
#     Visit:
#    <position>. <grade_of_minus>
# 
# 
# TODO: 2. Show students stats
#  ФИО;;Дз и Пз у которыч прочерк не учавствуют в числении среднего 
#  нужно подсчитывать количество оценок которые не равны "-"  потом использовать 
#  общая средняя оценка по всем выполненным ДЗ и ПЗ
#  средняя оценка за ПЗ;
#  количество выполненных ПЗ и общее количество ПЗ;
#  процент выполненных ПЗ;
#  средняя оценка за ДЗ;
#  количество выполненных ДЗ и общее количество ДЗ;
#  процент выполненных ДЗ;
#  количество посещённых занятий и общее количество занятий;
#  количество посещенных занятий и общее количество занятий 
#  процент посещений.
# 
# TODO: 3. Change full name 
# запросить что конкретно пользователь хочет изменить : 1. 2. 3. 
# 1.запрасить фамилию - проверяем точно также как наверху если проверки прошли то меняем данные
# 2.запрасить тмя   - проверяем точно также как наверху  если проверки прошли то меняем данные
# 3.запрасить отчество   - проверяем точно также как наверху  если проверки прошли то меняем данные
# 
# 
# 
# TODO: 4.  ADD HW
# условимся что "-" это задание которое не оценено 
# hw_list.append("-")

# TODO: 5. Grade HW
# Запрасить номер задания который лежит в hw_list 
# Проверить номер задания на границы (допустимые от 1 до len (hw_list))
# если номер в порядке запрасить оценку 
# Проверить оценку на границу (допустимые целые от 1 до 12 включительно)
# Если границы в порядке то изменяем на новую оценку по индексу (позиция - 1)

# TODO: 6. Delete HW Grade 
#  Запрасить номер задания который лежит в hw_list 
#  Проверить номер задания на границы (допустимые от 1 до len (hw_list))
#  если номер в порядке удаляем по индексу (позиция - 1)

# TODO:для PA все онологично HW  7,8,9 

# TODO: 10. Add visit
#  Показать под меню с пунктами 1 и 2 где 1 - present , 2 - absent.
#  Запрашиваем выбор пункта
#  В любом верном пункте добавляем в  list_visit present или   absent 
#  
# TODO: 11. Change visit
# Запрашиваем номер пасищения который лежит в list_visit
# Проверяем номер на границы (допустимые от 1 до len(list_visit) включительно)
# Если номер посещения в порядке то Показать под меню с пунктами 1 и 2 где 1 - present , 2 - absent.
#  Запрашиваем выбор пункта 
#  в любом верном пункте по указанному индексу (позиция - 1) заменяем на present  или  absent
# 
# TODO: 12. Delete Visit
# Запрашиваем номер пасищения который лежит в list_visit
# Проверяем номер на границы (допустимые от 1 до len(list_visit) включительно)
#  del list_visit[index]
# 
# 
# 
# 