student_id = ""
f_name = ""
l_name = ""
m_name = ""
hw_list = list()
pa_list = list()
list_visit = list()


# TODO: запрашиваем  id студента 
# TODO: запрашиваем  ФИО студента 
# запрашиваем ФИО студента
# Проверить , чтобы ФИО не содержало цифры и пробелы
# если ФИО не корректно то оповещаем и заново запросить(отдельно для каждой переменной)
# ФИО должно начинаться с большой буквы - title применить 


# TODO: Создать меню - while true 
# TODO: пункты меню 
#  1. Show student data 
#    Student ID: <student_id>
#    Full name: <l_name> <f_name> <m_name>
#    Homeworks: 
#    <position>. <grade_of_minus>
# 
#     Practical tasks:
#    <position>. <grade_of_minus>
#   
#     Visit:
#    <position>. <grade_of_minus>
# 
# 
# TODO: 2. Show students stats
#  ФИО;
#  общая средняя оценка по всем выполненным ДЗ и ПЗ;
#  средняя оценка за ПЗ;
#  количество выполненных ПЗ и общее количество ПЗ;
#  процент выполненных ПЗ;
#  средняя оценка за ДЗ;
#  количество выполненных ДЗ и общее количество ДЗ;
#  процент выполненных ДЗ;
#  количество посещённых занятий и общее количество занятий;
#  процент посещений.
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 